0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0684e-08;     

boundaryField
{
    b4-inlet
    {
        type            calculated;
        value           $internalField;

    }
    b5-outlet
    {
        type            zeroGradient;

    }
    b6-humpWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 1e-16;

    }
    b7-topWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 1e-16;

    }
    b2-symmetry1
    {
        type            symmetry;

    }
    b3-symmetry2
    {
        type            symmetry;

    }

}


// ************************************************************************* //
