0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    b4-inlet
    {
        type            fixedValue; 
        value           $internalField;

    }
    b5-outlet
    {
        type            zeroGradient;

    }
    b6-humpWall
    {
        type            fixedValue;
        value           uniform 1.3355e+07;
    }
    b7-topWall
    {
        type            fixedValue;
        value           uniform 0.6188;
    }
    b2-symmetry1
    {
        type            symmetry;

    }
    b3-symmetry2
    {
        type            symmetry;
    }
}



// ************************************************************************* //
