0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    b4-inlet
    {
        type            zeroGradient;

    }
    b5-outlet
    {
        type            fixedValue;
        value           $internalField; 

    }
    b6-humpWall
    {
        type            zeroGradient;

    }
    b7-topWall
    {
        type            zeroGradient;

    }
    b2-symmetry1
    {
        type            symmetry;

    }
    b3-symmetry2
    {
        type            symmetry;

    }
}


// ************************************************************************* //
