0.orig/profileRefFieldInversion
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      profileRefFieldInversion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
44064
(
1e+16
1e+16
1e+16
1e+16
1e+16
1e+16
1e+16
1e+16
...
)
;
boundaryField
{
	b2-symmetry1
	{
	    type            symmetry;
	}
	b3-symmetry2
	{
	    type            symmetry;
	}
	b4-inlet
	{
	    type            zeroGradient;
	}
	b5-outlet
	{
	    type            zeroGradient;
	}
	b6-humpWall
	{
	    type            zeroGradient;
	}
	b7-topWall
	{
	    type            zeroGradient;
	}
}
// ************************************************************************* //