constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    b2-symmetry1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          44064;
        startFace       87612;
    }
    b3-symmetry2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          44064;
        startFace       131676;
    }
    b4-inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          108;
        startFace       175740;
    }
    b5-outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          108;
        startFace       175848;
    }
    b6-humpWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          408;
        startFace       175956;
    }
    b7-topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          408;
        startFace       176364;
    }
)

// ************************************************************************* //
