constant/transportProperties
/*--------------------------------*- C++ -*---------------------------------*\ 
:q
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

nu          1.0684e-06; // was 3.698942e-5 for un-normalised velocity 
Pr          0.7;
Prt         1.0;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
